[
  {
    "name": "Python",
    "description": "A versatile, high-level programming language. Widely used for web development (e.g., Django, Flask), data science, machine learning, automation, and scientific computing. Known for its readability and extensive libraries.",
    "category": "Programming Language",
    "aliases": ["py", "python3", "python programming"]
  },
  {
    "name": "JavaScript",
    "description": "A dynamic, high-level scripting language, essential for front-end web development. Used for creating interactive user interfaces, and with Node.js, for server-side programming. Supports event-driven, functional, and imperative programming styles.",
    "category": "Programming Language",
    "aliases": ["js", "ecmascript", "es6+", "vanilla js"]
  },
  {
    "name": "TypeScript",
    "description": "A statically typed superset of JavaScript that adds optional types, classes, and modules, compiling to plain JavaScript. Improves code quality and maintainability in large-scale applications.",
    "category": "Programming Language",
    "aliases": ["ts"]
  },
  {
    "name": "Java",
    "description": "A robust, object-oriented, platform-independent programming language. Commonly used for large-scale enterprise applications, Android mobile development, and backend systems (e.g., Spring Boot).",
    "category": "Programming Language",
    "aliases": ["j2ee", "jee", "java se", "java ee", "spring framework"]
  },
  {
    "name": "C#",
    "description": "A modern, object-oriented programming language developed by Microsoft. Widely used for building Windows applications, web services with .NET, and game development with Unity.",
    "category": "Programming Language",
    "aliases": ["c sharp", "csharp", ".net framework", "dotnet core"]
  },
  {
    "name": "C++",
    "description": "A powerful, high-performance programming language offering low-level memory manipulation. Used for system software, game engines, embedded systems, and performance-critical applications.",
    "category": "Programming Language",
    "aliases": ["cpp", "c plus plus"]
  },
  {
    "name": "Go",
    "description": "A statically typed, compiled language designed by Google for simplicity, efficiency, and high performance in concurrent systems. Often used for cloud infrastructure, networking tools, and backend services.",
    "category": "Programming Language",
    "aliases": ["golang"]
  },
  {
    "name": "Ruby",
    "description": "A dynamic, open-source programming language with a focus on developer productivity and happiness. Popular for web development, especially with the Ruby on Rails framework.",
    "category": "Programming Language",
    "aliases": []
  },
  {
    "name": "PHP",
    "description": "A widely-used open-source scripting language, particularly suited for web development and server-side scripting. Powers many content management systems like WordPress.",
    "category": "Programming Language",
    "aliases": []
  },
  {
    "name": "Swift",
    "description": "A powerful and intuitive programming language developed by Apple for macOS, iOS, watchOS, and tvOS application development. Known for its safety, speed, and modern syntax.",
    "category": "Programming Language",
    "aliases": ["ios swift programming"]
  },
  {
    "name": "Kotlin",
    "description": "A modern, statically typed programming language targeting the JVM, Android, JavaScript, and Native. Known for its concise syntax, null safety, and interoperability with Java. Official language for Android development.",
    "category": "Programming Language",
    "aliases": ["android kotlin programming"]
  },
  {
    "name": "HTML",
    "description": "HyperText Markup Language, the standard markup language for creating the structure of web pages and web applications.",
    "category": "Web Development (Frontend)",
    "aliases": ["html5", "web structure"]
  },
  {
    "name": "CSS",
    "description": "Cascading Style Sheets, a style sheet language used for describing the presentation and visual styling of documents written in HTML or XML.",
    "category": "Web Development (Frontend)",
    "aliases": ["css3", "web styling"]
  },
  {
    "name": "Sass/SCSS",
    "description": "A preprocessor scripting language that is interpreted or compiled into CSS. Adds features like variables, nesting, and mixins to make CSS more maintainable and powerful.",
    "category": "Web Development (Frontend)",
    "aliases": ["sass", "scss", "css preprocessor"]
  },
  {
    "name": "React",
    "description": "A popular JavaScript library for building dynamic user interfaces and single-page applications. Focuses on component-based architecture and efficient state management using tools like Redux or Context API.",
    "category": "Web Development (Frontend)",
    "aliases": ["react.js", "reactjs", "react hooks"]
  },
  {
    "name": "Angular",
    "description": "A comprehensive TypeScript-based open-source web application framework developed by Google. Suitable for building large-scale, feature-rich single-page applications (SPAs).",
    "category": "Web Development (Frontend)",
    "aliases": ["angular framework", "angular 2+"]
  },
  {
    "name": "Vue.js",
    "description": "A progressive JavaScript framework for building user interfaces and single-page applications. Known for its approachability, flexibility, and performance.",
    "category": "Web Development (Frontend)",
    "aliases": ["vue", "vuejs"]
  },
  {
    "name": "Next.js",
    "description": "A popular React framework for production, enabling server-side rendering (SSR), static site generation (SSG), API routes, and optimized builds for performant web applications.",
    "category": "Web Development (Fullstack)",
    "aliases": ["nextjs", "react ssr"]
  },
  {
    "name": "Node.js",
    "description": "A JavaScript runtime environment built on Chrome's V8 engine. Enables server-side scripting with JavaScript, commonly used for building scalable network applications, APIs, and backend services with frameworks like Express.js.",
    "category": "Web Development (Backend)",
    "aliases": ["node", "nodejs server-side"]
  },
  {
    "name": "Express.js",
    "description": "A minimal and flexible Node.js web application framework. Provides a robust set of features for building web and mobile application backends and APIs.",
    "category": "Web Development (Backend)",
    "aliases": ["express", "expressjs framework"]
  },
  {
    "name": "Django",
    "description": "A high-level Python web framework that encourages rapid development and clean, pragmatic design. Follows the MTV (Model-Template-View) pattern, suitable for building complex, database-driven websites.",
    "category": "Web Development (Backend)",
    "aliases": ["python django framework"]
  },
  {
    "name": "Flask",
    "description": "A lightweight and extensible Python web microframework. Ideal for building smaller applications, APIs, and prototypes quickly, offering more flexibility than larger frameworks.",
    "category": "Web Development (Backend)",
    "aliases": ["python flask microframework"]
  },
  {
    "name": "Spring Boot",
    "description": "A Java-based framework that simplifies the creation of stand-alone, production-grade Spring-based applications. Offers auto-configuration, embedded servers, and production-ready features.",
    "category": "Web Development (Backend)",
    "aliases": ["spring framework", "java spring"]
  },
  {
    "name": "Ruby on Rails",
    "description": "A server-side web application framework written in Ruby. Follows the Model-View-Controller (MVC) pattern and emphasizes convention over configuration for rapid development.",
    "category": "Web Development (Backend)",
    "aliases": ["rails", "ror framework"]
  },
  {
    "name": "REST API Design",
    "description": "Designing and developing Representational State Transfer (RESTful) APIs. Involves defining resources, using HTTP methods correctly, and ensuring stateless, client-server communication for web services.",
    "category": "API Development",
    "aliases": ["restful api development", "rest principles", "api design"]
  },
  {
    "name": "GraphQL",
    "description": "A query language for APIs and a server-side runtime for executing those queries. Allows clients to request only the data they need, improving efficiency over traditional REST APIs.",
    "category": "API Development",
    "aliases": ["graphql api"]
  },
  {
    "name": "API Integration",
    "description": "Connecting different software applications at the API level to enable them to exchange data and functionality. Involves working with third-party APIs and ensuring seamless system interoperability.",
    "category": "API Development",
    "aliases": ["system integration", "third-party api consumption"]
  },
  {
    "name": "PostgreSQL",
    "description": "A powerful, open-source object-relational database system (ORDBMS) with a strong reputation for reliability, feature robustness, and performance. Supports complex queries and data types.",
    "category": "Database Management",
    "aliases": ["postgres", "pgsql rdbms"]
  },
  {
    "name": "MySQL",
    "description": "An open-source relational database management system (RDBMS) based on SQL. Widely used in web applications, often part of the LAMP stack. Known for its ease of use and reliability.",
    "category": "Database Management",
    "aliases": ["mysql rdbms"]
  },
  {
    "name": "MongoDB",
    "description": "A popular NoSQL, document-oriented database. Stores data in flexible, JSON-like documents (BSON), designed for scalability, high availability, and agile development.",
    "category": "Database Management",
    "aliases": ["mongo", "nosql document db"]
  },
  {
    "name": "Redis",
    "description": "An open-source, in-memory key-value data store. Used as a high-performance database, cache, message broker, and session manager.",
    "category": "Database Management",
    "aliases": ["redis cache", "key-value store"]
  },
  {
    "name": "Elasticsearch",
    "description": "A distributed, RESTful search and analytics engine built on Apache Lucene. Capable of full-text search, log analytics, and real-time data visualization (often with Kibana).",
    "category": "Search & Analytics",
    "aliases": ["elastic search engine", "elk stack"]
  },
  {
    "name": "SQL",
    "description": "Structured Query Language, the standard language for managing and manipulating data in relational databases (RDBMS) like MySQL, PostgreSQL, SQL Server, and Oracle.",
    "category": "Database Management",
    "aliases": ["structured query language", "database querying"]
  },
  {
    "name": "Docker",
    "description": "A platform for developing, shipping, and running applications in isolated environments called containers. Ensures consistency across development, testing, and production.",
    "category": "DevOps & CI/CD",
    "aliases": ["containerization", "docker containers"]
  },
  {
    "name": "Kubernetes",
    "description": "An open-source system for automating the deployment, scaling, and management of containerized applications (like Docker containers). Orchestrates clusters of virtual or physical machines.",
    "category": "DevOps & CI/CD",
    "aliases": ["k8s", "container orchestration"]
  },
  {
    "name": "AWS (Amazon Web Services)",
    "description": "A comprehensive and broadly adopted cloud computing platform from Amazon. Offers a wide range of services including compute (EC2), storage (S3), databases (RDS), machine learning, and networking.",
    "category": "Cloud Computing",
    "aliases": ["amazon web services", "aws cloud"]
  },
  {
    "name": "Microsoft Azure",
    "description": "Microsoft's cloud computing platform. Provides a vast array of services including virtual machines, AI + machine learning, storage, analytics, and IoT.",
    "category": "Cloud Computing",
    "aliases": ["azure cloud", "ms azure"]
  },
  {
    "name": "Google Cloud Platform (GCP)",
    "description": "A suite of cloud computing services offered by Google. Runs on the same infrastructure that powers Google's end-user products, providing compute, storage, big data, and machine learning services.",
    "category": "Cloud Computing",
    "aliases": ["gcp", "google cloud"]
  },
  {
    "name": "CI/CD Pipelines",
    "description": "Continuous Integration and Continuous Deployment/Delivery practices. Involves automating the software build, test, and deployment pipeline using tools like Jenkins, GitLab CI, GitHub Actions.",
    "category": "DevOps & CI/CD",
    "aliases": [
      "cicd",
      "continuous integration",
      "continuous deployment",
      "devops automation"
    ]
  },
  {
    "name": "Terraform",
    "description": "An open-source infrastructure as code (IaC) software tool. Allows users to define and provision data center infrastructure using a declarative configuration language.",
    "category": "DevOps & CI/CD",
    "aliases": ["iac", "infrastructure as code"]
  },
  {
    "name": "Ansible",
    "description": "An open-source automation tool for configuration management, application deployment, task automation, and IT orchestration. Uses YAML for playbooks.",
    "category": "DevOps & CI/CD",
    "aliases": ["configuration management"]
  },
  {
    "name": "Git",
    "description": "A distributed version control system for tracking changes in source code during software development. Essential for team collaboration and managing code history.",
    "category": "DevOps & CI/CD",
    "aliases": ["version control system", "github", "gitlab", "bitbucket"]
  },
  {
    "name": "Linux Administration",
    "description": "Managing and maintaining Linux-based operating systems and servers. Includes tasks like user management, package installation, shell scripting, and system monitoring.",
    "category": "Operating Systems & Administration",
    "aliases": ["linux server admin", "unix admin"]
  },
  {
    "name": "Windows Server Administration",
    "description": "Managing Microsoft Windows Server operating systems. Involves Active Directory, Group Policy, IIS, and other Windows-specific server technologies.",
    "category": "Operating Systems & Administration",
    "aliases": ["win server admin", "active directory"]
  },
  {
    "name": "Shell Scripting (Bash/Sh)",
    "description": "Writing scripts for Unix/Linux command-line shells (like Bash or sh) to automate tasks, manage files, and control system operations.",
    "category": "Operating Systems & Administration",
    "aliases": ["bash scripting", "sh scripting", "linux scripting"]
  },
  {
    "name": "PowerShell Scripting",
    "description": "A task automation and configuration management framework from Microsoft, consisting of a command-line shell and scripting language built on .NET.",
    "category": "Operating Systems & Administration",
    "aliases": ["powershell", "windows scripting"]
  },
  {
    "name": "Machine Learning (ML)",
    "description": "A branch of Artificial Intelligence (AI) focused on building systems that can learn from data, identify patterns, and make decisions with minimal human intervention. Includes supervised, unsupervised, and reinforcement learning.",
    "category": "AI & Machine Learning",
    "aliases": ["ml modeling", "predictive analytics"]
  },
  {
    "name": "Deep Learning (DL)",
    "description": "A subset of machine learning involving artificial neural networks with multiple layers (deep neural networks). Used for complex tasks like image recognition, natural language processing, and speech recognition.",
    "category": "AI & Machine Learning",
    "aliases": ["dl models", "deep neural networks", "ann"]
  },
  {
    "name": "Natural Language Processing (NLP)",
    "description": "A field of AI that enables computers to process, understand, interpret, and generate human language. Applications include sentiment analysis, machine translation, and chatbots.",
    "category": "AI & Machine Learning",
    "aliases": ["nlp techniques", "text analytics"]
  },
  {
    "name": "Computer Vision (CV)",
    "description": "A field of AI that trains computers to interpret and understand visual information from images or videos. Applications include object detection, image classification, and facial recognition.",
    "category": "AI & Machine Learning",
    "aliases": ["cv algorithms", "image processing"]
  },
  {
    "name": "PyTorch",
    "description": "An open-source machine learning library, primarily developed by Facebook's AI Research lab. Widely used for deep learning applications such as computer vision and natural language processing. Known for its Pythonic feel and dynamic computation graphs.",
    "category": "AI & Machine Learning",
    "aliases": ["torch", "pytorch framework"]
  },
  {
    "name": "TensorFlow",
    "description": "An end-to-end open-source platform for machine learning developed by Google. Provides a comprehensive ecosystem of tools, libraries, and community resources for building and deploying ML-powered applications, often used with Keras API.",
    "category": "AI & Machine Learning",
    "aliases": ["tf", "google tensorflow", "keras api"]
  },
  {
    "name": "Scikit-learn",
    "description": "A popular Python library for machine learning. Provides simple and efficient tools for data mining and data analysis, including algorithms for classification, regression, clustering, and dimensionality reduction.",
    "category": "AI & Machine Learning",
    "aliases": ["sklearn", "python machine learning library"]
  },
  {
    "name": "Pandas",
    "description": "A powerful Python library for data manipulation and analysis. Provides high-performance, easy-to-use data structures like DataFrames, essential for cleaning, transforming, and analyzing structured data.",
    "category": "Data Science & Analysis",
    "aliases": ["python pandas library", "dataframes"]
  },
  {
    "name": "NumPy",
    "description": "A fundamental Python library for numerical computing. Supports large, multi-dimensional arrays and matrices, along with a collection of mathematical functions to operate on these arrays efficiently.",
    "category": "Data Science & Analysis",
    "aliases": ["python numpy library", "numerical python"]
  },
  {
    "name": "Matplotlib",
    "description": "A comprehensive Python library for creating static, animated, and interactive visualizations in Python. Produces publication-quality figures in a variety of formats.",
    "category": "Data Science & Analysis",
    "aliases": ["python matplotlib plotting", "data visualization python"]
  },
  {
    "name": "Seaborn",
    "description": "A Python data visualization library based on Matplotlib. Provides a high-level interface for drawing attractive and informative statistical graphics.",
    "category": "Data Science & Analysis",
    "aliases": ["python seaborn plotting", "statistical visualization"]
  },
  {
    "name": "R Language",
    "description": "A programming language and free software environment specifically designed for statistical computing, data analysis, and graphics. Widely used by statisticians and data miners.",
    "category": "Data Science & Analysis",
    "aliases": ["r programming", "statistical r"]
  },
  {
    "name": "Statistical Analysis",
    "description": "The science of collecting, exploring, interpreting, and presenting data to discover underlying patterns, trends, and insights. Involves hypothesis testing, regression, and other statistical methods.",
    "category": "Data Science & Analysis",
    "aliases": ["statistics", "data interpretation"]
  },
  {
    "name": "Data Engineering",
    "description": "Designing and building systems for collecting, storing, and analyzing data at scale. Involves creating data pipelines, ETL processes, and managing data warehouses and data lakes.",
    "category": "Data Engineering",
    "aliases": ["big data engineering", "data pipeline development"]
  },
  {
    "name": "Data Warehousing",
    "description": "The process of designing, building, and maintaining data warehouses. These are central repositories of integrated data from one or more disparate sources, used for reporting and data analysis.",
    "category": "Data Engineering",
    "aliases": ["dwh design", "data storage solutions"]
  },
  {
    "name": "ETL Development",
    "description": "Extract, Transform, Load (ETL) is a data integration process. Involves extracting data from various sources, transforming it into a usable format, and loading it into a data warehouse or other target system.",
    "category": "Data Engineering",
    "aliases": ["extract transform load", "data integration"]
  },
  {
    "name": "Apache Spark",
    "description": "An open-source distributed processing system used for big data workloads. Provides fast in-memory data processing for analytics, machine learning, and stream processing.",
    "category": "Data Engineering",
    "aliases": ["spark big data", "distributed computing"]
  },
  {
    "name": "Apache Kafka",
    "description": "A distributed event streaming platform used for building real-time data pipelines and streaming applications. Handles high-throughput, fault-tolerant message brokering.",
    "category": "Data Engineering",
    "aliases": ["kafka streaming", "message queue"]
  },
  {
    "name": "Tableau",
    "description": "A powerful interactive data visualization software. Used for creating dashboards, reports, and exploring data to gain business insights.",
    "category": "Business Intelligence & Visualization",
    "aliases": ["tableau dashboards"]
  },
  {
    "name": "Microsoft Power BI",
    "description": "A business analytics service by Microsoft. Provides interactive visualizations and business intelligence capabilities with an easy-to-use interface for creating reports and dashboards.",
    "category": "Business Intelligence & Visualization",
    "aliases": ["powerbi reports", "ms power bi"]
  },
  {
    "name": "Excel (Advanced)",
    "description": "Advanced use of Microsoft Excel for data analysis, including pivot tables, complex formulas, VBA macros, Power Query, and data modeling for business intelligence.",
    "category": "Business Intelligence & Visualization",
    "aliases": ["advanced excel", "excel vba", "excel data analysis"]
  },
  {
    "name": "Jira",
    "description": "A popular issue tracking and project management tool developed by Atlassian. Widely used by agile development teams for bug tracking, task management, and sprint planning.",
    "category": "Project & Product Management",
    "aliases": ["jira agile", "issue tracking"]
  },
  {
    "name": "Confluence",
    "description": "A team collaboration and knowledge management tool by Atlassian. Used for creating, sharing, and organizing project documentation, meeting notes, and team knowledge bases.",
    "category": "Project & Product Management",
    "aliases": ["confluence wiki", "documentation platform"]
  },
  {
    "name": "Agile Methodologies",
    "description": "A set of principles and practices for iterative software development and project management. Emphasizes collaboration, customer feedback, and rapid adaptation to change. Includes frameworks like Scrum and Kanban.",
    "category": "Project & Product Management",
    "aliases": ["agile project management", "agile principles"]
  },
  {
    "name": "Scrum Framework",
    "description": "An agile framework for managing complex projects, particularly software development. Uses iterative cycles (sprints), defined roles (Product Owner, Scrum Master, Development Team), and specific events.",
    "category": "Project & Product Management",
    "aliases": ["scrum master", "agile scrum"]
  },
  {
    "name": "Kanban System",
    "description": "A lean method to manage and improve work across human systems. Visualizes workflow, limits work in progress (WIP), and focuses on flow efficiency.",
    "category": "Project & Product Management",
    "aliases": ["kanban board", "lean workflow"]
  },
  {
    "name": "Product Management",
    "description": "The strategic process of guiding a product's lifecycle from conception through launch and iteration. Involves market research, defining product vision, roadmap planning, and working with cross-functional teams.",
    "category": "Project & Product Management",
    "aliases": ["pm", "product strategy", "product roadmap"]
  },
  {
    "name": "Business Analysis",
    "description": "The practice of identifying business needs and determining solutions to business problems. Involves requirements gathering, process modeling, and stakeholder communication to bridge the gap between business and IT.",
    "category": "Project & Product Management",
    "aliases": ["ba", "requirements analysis", "process improvement"]
  },
  {
    "name": "UI (User Interface) Design",
    "description": "The process of designing the visual look and feel of software applications, websites, or devices. Focuses on aesthetics, visual hierarchy, and creating an engaging and intuitive interface for users.",
    "category": "Design (UI/UX)",
    "aliases": ["user interface design", "visual design"]
  },
  {
    "name": "UX (User Experience) Design",
    "description": "The process of enhancing user satisfaction by improving the usability, accessibility, and pleasure provided in the interaction between the user and the product. Involves research, wireframing, prototyping, and user testing.",
    "category": "Design (UI/UX)",
    "aliases": ["user experience design", "usability"]
  },
  {
    "name": "User Research",
    "description": "The systematic study of target users and their requirements to add realistic contexts and insights to the design process. Methods include interviews, surveys, usability testing, and persona creation.",
    "category": "Design (UI/UX)",
    "aliases": ["ux research", "customer research"]
  },
  {
    "name": "Figma",
    "description": "A collaborative, web-based interface design tool. Used for UI/UX design, prototyping, creating design systems, and real-time team collaboration.",
    "category": "Design (UI/UX)",
    "aliases": ["figma design tool"]
  },
  {
    "name": "Adobe XD",
    "description": "A vector-based user experience design tool by Adobe for web apps and mobile apps. Used for designing, prototyping, and sharing user experiences.",
    "category": "Design (UI/UX)",
    "aliases": ["xd prototyping"]
  },
  {
    "name": "Adobe Photoshop",
    "description": "A powerful raster graphics editor by Adobe. Widely used for image editing, photo retouching, graphic design, and digital art creation.",
    "category": "Design (Graphics & Media)",
    "aliases": ["photoshop editing", "ps graphics"]
  },
  {
    "name": "Adobe Illustrator",
    "description": "A vector graphics editor and design program by Adobe. Used for creating logos, icons, illustrations, typography, and other scalable graphics.",
    "category": "Design (Graphics & Media)",
    "aliases": ["illustrator vector", "ai graphics"]
  },
  {
    "name": "Quality Assurance (QA)",
    "description": "The systematic process of ensuring that software products meet specified requirements and quality standards. Involves test planning, test case design, execution, and defect tracking.",
    "category": "Software Testing & QA",
    "aliases": ["software testing", "qa testing"]
  },
  {
    "name": "Manual Testing",
    "description": "The process of manually testing software for defects without using automation tools. Involves executing test cases by hand and verifying actual results against expected results.",
    "category": "Software Testing & QA",
    "aliases": ["manual qa"]
  },
  {
    "name": "Automated Testing",
    "description": "Using software tools to execute pre-scripted tests on a software application before releasing it into production. Includes unit, integration, and end-to-end test automation.",
    "category": "Software Testing & QA",
    "aliases": ["test automation", "qa automation"]
  },
  {
    "name": "Unit Testing",
    "description": "A software testing method where individual units or components of source code are tested in isolation to determine if they are fit for use.",
    "category": "Software Testing & QA",
    "aliases": ["code unit tests"]
  },
  {
    "name": "Integration Testing",
    "description": "A level of software testing where individual software modules are combined and tested as a group to ensure they work together correctly.",
    "category": "Software Testing & QA",
    "aliases": ["module integration tests"]
  },
  {
    "name": "Selenium WebDriver",
    "description": "A popular open-source framework for automating web browser interactions. Used for creating automated tests for web applications across different browsers.",
    "category": "Software Testing & QA",
    "aliases": ["selenium automation", "browser automation"]
  },
  {
    "name": "Jest",
    "description": "A JavaScript testing framework with a focus on simplicity, widely used for testing React applications, Node.js services, and other JavaScript codebases.",
    "category": "Software Testing & QA",
    "aliases": ["jest js testing"]
  },
  {
    "name": "Cypress.io",
    "description": "A modern, end-to-end JavaScript testing framework built for testing web applications. Known for its ease of use, fast execution, and debugging capabilities.",
    "category": "Software Testing & QA",
    "aliases": ["cypress e2e testing"]
  },
  {
    "name": "Mobile Application Development",
    "description": "The process of creating software applications that run on mobile devices such as smartphones and tablets. Includes native (iOS, Android) and cross-platform development.",
    "category": "Mobile Development",
    "aliases": ["mobile app dev", "app development"]
  },
  {
    "name": "Android Development (Native)",
    "description": "Creating applications specifically for the Android operating system using languages like Java or Kotlin and Android SDK.",
    "category": "Mobile Development",
    "aliases": ["native android apps", "android sdk"]
  },
  {
    "name": "iOS Development (Native)",
    "description": "Creating applications specifically for Apple's iOS (and iPadOS) operating system using Swift or Objective-C and iOS SDK.",
    "category": "Mobile Development",
    "aliases": ["native ios apps", "ios sdk"]
  },
  {
    "name": "React Native",
    "description": "A JavaScript framework for building natively rendering mobile applications for iOS and Android from a single codebase, based on React.",
    "category": "Mobile Development",
    "aliases": ["rn cross-platform", "react mobile"]
  },
  {
    "name": "Flutter",
    "description": "An open-source UI software development kit created by Google for building natively compiled applications for mobile (iOS, Android), web, and desktop from a single codebase using the Dart language.",
    "category": "Mobile Development",
    "aliases": ["flutter cross-platform", "dart mobile"]
  },
  {
    "name": "Cybersecurity Fundamentals",
    "description": "Understanding and applying core principles and practices for protecting computer systems, networks, and data from digital attacks, unauthorized access, and damage.",
    "category": "Security",
    "aliases": ["information security basics", "network security principles"]
  },
  {
    "name": "Penetration Testing",
    "description": "A simulated cyber attack against a computer system or network to identify exploitable vulnerabilities before attackers do. Also known as ethical hacking.",
    "category": "Security",
    "aliases": ["pen testing", "ethical hacking", "vulnerability assessment"]
  },
  {
    "name": "OAuth 2.0 / OpenID Connect",
    "description": "Open standards for access delegation and authentication. OAuth 2.0 is commonly used for authorization, while OpenID Connect (OIDC) is an identity layer built on top of OAuth 2.0.",
    "category": "Security",
    "aliases": ["oauth2", "oidc", "sso protocols"]
  },
  {
    "name": "Salesforce CRM",
    "description": "Expertise in using and customizing the Salesforce Customer Relationship Management (CRM) platform, including sales, service, and marketing clouds.",
    "category": "Business Systems",
    "aliases": ["sfdc", "salesforce administration", "salesforce development"]
  },
  {
    "name": "SAP ERP",
    "description": "Knowledge of SAP Enterprise Resource Planning (ERP) systems, covering modules like FI/CO, SD, MM, PP for managing business operations.",
    "category": "Business Systems",
    "aliases": ["sap fico", "sap s/4hana"]
  },
  {
    "name": "Communication Skills",
    "description": "Effectively conveying information, ideas, and instructions both verbally and in writing. Includes active listening, clarity, and adapting communication style to the audience.",
    "category": "Soft Skills",
    "aliases": [
      "interpersonal communication",
      "verbal skills",
      "written skills",
      "presentation skills"
    ]
  },
  {
    "name": "Problem-Solving",
    "description": "Identifying, analyzing, and resolving complex issues or challenges. Involves critical thinking, analytical skills, and developing creative and effective solutions.",
    "category": "Soft Skills",
    "aliases": [
      "analytical thinking",
      "critical thinking skills",
      "troubleshooting"
    ]
  },
  {
    "name": "Teamwork & Collaboration",
    "description": "Working effectively with others in a team environment to achieve common goals. Includes cooperation, sharing responsibilities, and contributing to a positive team dynamic.",
    "category": "Soft Skills",
    "aliases": ["collaboration skills", "team player"]
  },
  {
    "name": "Leadership & Management",
    "description": "Guiding, motivating, and managing individuals or teams to achieve objectives. Involves decision-making, delegation, conflict resolution, and fostering growth.",
    "category": "Soft Skills",
    "aliases": ["team leadership", "people management", "project leadership"]
  },
  {
    "name": "Time Management & Organization",
    "description": "Effectively planning and controlling how time is spent on specific activities to increase efficiency and productivity. Includes prioritization, scheduling, and meeting deadlines.",
    "category": "Soft Skills",
    "aliases": ["organizational skills", "prioritization"]
  },
  {
    "name": "Data Structures & Algorithms (DSA)",
    "description": "Fundamental concepts in computer science for designing and analyzing efficient ways to store and process data, and solve computational problems.",
    "category": "Computer Science Fundamentals",
    "aliases": [
      "dsa principles",
      "algorithm design",
      "data structure implementation"
    ]
  },
  {
    "name": "System Design & Architecture",
    "description": "The process of defining the architecture, components, modules, interfaces, and data for a system to satisfy specified requirements. Focuses on scalability, reliability, and maintainability.",
    "category": "Software Architecture",
    "aliases": ["software architecture design", "solution architecture"]
  },
  {
    "name": "Microservices Architecture",
    "description": "An architectural style that structures an application as a collection of small, autonomous, and independently deployable services. Promotes scalability and agility.",
    "category": "Software Architecture",
    "aliases": ["microservice design patterns"]
  },
  {
    "name": "Serverless Computing",
    "description": "A cloud computing execution model where the cloud provider dynamically manages the allocation and provisioning of servers. Developers focus on writing functions (FaaS - Functions as a Service).",
    "category": "Cloud Computing",
    "aliases": [
      "serverless architecture patterns",
      "aws lambda",
      "azure functions",
      "google cloud functions"
    ]
  },
  {
    "name": "Blockchain Technology",
    "description": "A decentralized, distributed, and immutable ledger technology. Used for secure transaction recording, asset tracking, and building decentralized applications (dApps).",
    "category": "Emerging Technologies",
    "aliases": ["distributed ledger technology", "smart contracts"]
  },
  {
    "name": "Internet of Things (IoT)",
    "description": "A network of interconnected physical devices, vehicles, and other items embedded with sensors, software, and connectivity, enabling them to collect and exchange data.",
    "category": "Emerging Technologies",
    "aliases": ["iot solutions", "iot platforms"]
  },
  {
    "name": "Web Scraping & Crawling",
    "description": "Automated techniques for extracting large amounts of data from websites. Involves using tools and scripts (e.g., Python with Beautiful Soup, Scrapy) to gather web content.",
    "category": "Data Engineering",
    "aliases": ["data scraping techniques", "web crawler development"]
  },
  {
    "name": "Technical Writing & Documentation",
    "description": "Creating clear, concise, and accurate technical documentation such as API guides, user manuals, system specifications, and knowledge base articles.",
    "category": "Communication & Documentation",
    "aliases": ["software documentation", "api documentation"]
  },
  {
    "name": "A/B Testing & Experimentation",
    "description": "A method of comparing two versions of a webpage, app feature, or product against each other to determine which one performs better based on specific metrics. Key for data-driven product decisions.",
    "category": "Product Management & Analytics",
    "aliases": [
      "split testing",
      "conversion rate optimization",
      "experiment design"
    ]
  },
  {
    "name": "Search Engine Optimization (SEO)",
    "description": "The process of improving a website's visibility in search engine results pages (SERPs). Involves on-page optimization, keyword research, link building, and technical SEO.",
    "category": "Digital Marketing",
    "aliases": ["seo strategy", "keyword analysis"]
  },
  {
    "name": "Digital Marketing Strategy",
    "description": "Planning and executing marketing campaigns using digital channels such as search engines, social media, email, and websites to reach and engage target audiences.",
    "category": "Digital Marketing",
    "aliases": ["online marketing", "content marketing strategy"]
  },
  {
    "name": "Content Creation (Technical & Marketing)",
    "description": "Developing engaging and informative content, including blog posts, articles, whitepapers, case studies, videos, and social media updates, tailored for technical or marketing audiences.",
    "category": "Digital Marketing",
    "aliases": ["technical content writing", "marketing content development"]
  },
  {
    "name": "Google Analytics (GA4)",
    "description": "A web analytics service by Google that tracks and reports website and app traffic and user behavior. GA4 is the latest version with event-based data model.",
    "category": "Digital Marketing",
    "aliases": ["ga4", "web analytics", "user behavior tracking"]
  },
  {
    "name": "Video Editing & Production",
    "description": "The process of manipulating and arranging video shots to create a coherent narrative or visual presentation. Includes software like Adobe Premiere Pro, Final Cut Pro.",
    "category": "Media & Content Creation",
    "aliases": ["video production", "post-production"]
  },
  {
    "name": "3D Modeling & Animation",
    "description": "Creating three-dimensional digital representations of objects or characters and bringing them to life through animation. Uses software like Blender, Maya, 3ds Max.",
    "category": "Design (Graphics & Media)",
    "aliases": ["3d graphics", "character animation"]
  },
  {
    "name": "Game Development (Unity)",
    "description": "Using the Unity game engine to design, develop, and deploy video games for various platforms including PC, consoles, and mobile devices.",
    "category": "Game Development",
    "aliases": ["unity3d game dev", "c# game development"]
  },
  {
    "name": "Game Development (Unreal Engine)",
    "description": "Using the Unreal Engine by Epic Games to create high-fidelity 3D games and interactive experiences. Often involves C++ programming and Blueprints visual scripting.",
    "category": "Game Development",
    "aliases": ["ue game dev", "unreal engine blueprints"]
  }
]
